app/views/surveys/_question_fields.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 16
SELECT "questions".* FROM "questions" WHERE "questions"."survey_id" = 9
---
  <%= f.text_area :content, :rows => 3 %><br>
      <%= f.select :question_type, [['Multiple Choice', Question::MULTIPLE_CHOICE],
                                    ['Short Answer', Question::SHORT_ANSWER],
                                    ['Long Answer', Question::LONG_ANSWER],
                                    ['Check List', Question::CHECKLIST],
                                    ['E-mail', Question::EMAIL]] %>