app/views/surveys/show.html.erb

    <% @questions.each do |question| %>
        <%question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 19