app/controllers/surveys_controller.rb

  def index
    @surveys = Survey.all
---
SELECT "surveys".* FROM "surveys"

  def show
    @survey = Survey.find(params[:id])
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @survey = Survey.find(params[:id])
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @survey = Survey.new(params[:survey])

    respond_to do |format|
      if @survey.save
---
INSERT INTO "surveys" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 08 Apr 2013 06:50:47 UTC +00:00], ["name", "Starbucks Test1"], ["updated_at", Mon, 08 Apr 2013 06:50:47 UTC +00:00]]

  def update
    @survey = Survey.find(params[:id])

    respond_to do |format|
      if @survey.update_attributes(params[:survey])
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "surveys" SET "name" = 'Starbucks Test2', "updated_at" = '2013-04-08 06:54:22.618200' WHERE "surveys"."id" = 1

  def destroy
    @survey = Survey.find(params[:id])
    @survey.destroy
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "surveys" WHERE "surveys"."id" = ?  [["id", 2]]